In [47]:
import pandas as pd

In [48]:
# 2 main datatypes
series = pd.Series(["BMW", "Toyota", "Honda"])

In [49]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [50]:
# series = 1-dimensional

In [51]:
colors = pd.Series(["Red", "Blue", "White"])
colors

0      Red
1     Blue
2    White
dtype: object

In [52]:
#DataFrame = 2-dimensional
car_data = pd.DataFrame({"Car make": series, "Color": colors})
car_data

  Car make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [53]:
# Import data
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [54]:
# export dataframe
car_sales.to_csv("exported-car-sales.csv", index = False)

In [ ]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")

In [ ]:
exported_car_sales

## Describe data

In [ ]:
# Attribute
car_sales.dtypes

# Function
# car_sales.tocsv

In [58]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [59]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [60]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [61]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [62]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [63]:
car_sales.mean()

C:\Users\dylan\AppData\Local\Temp\ipykernel_15600\4073448239.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [64]:
car_prices = pd.Series([3000, 1500, 111250])
car_prices.mean()

38583.333333333336

In [65]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [66]:
car_sales["Doors"].sum()

40

In [67]:
len(car_sales)

10

## Viewing and selecting data

In [68]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [69]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [70]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [71]:
# .loc and .iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"],
                   index = [0, 3, 9, 8, 3])

In [72]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [73]:
animals.loc[3]

3      dog
3    snake
dtype: object

In [74]:
animals.loc[9]

'bird'

In [75]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [76]:
# .iloc refers to position
animals.iloc[3]

'panda'

In [77]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [78]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [79]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [80]:
car_sales["Make"].iloc[3]

'BMW'

In [81]:
car_sales.Make.iloc[2]

'Toyota'

In [82]:
car_sales[car_sales["Make"]== "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [83]:
car_sales[car_sales["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [ ]:
pd.crosstab(car_sales["Make"], car_sales["Doors"])

In [ ]:
# Groupby
car_sales.groupby(["Make", car_sales["Colour"]=="White"]).mean()

In [ ]:
car_sales[(car_sales["Make"]== "Toyota") & (car_sales["Colour"] == "White")].groupby(["Make"]).mean()

In [ ]:
%matplotlib inline

In [ ]:
car_sales["Odometer (KM)"].plot()

In [ ]:
car_sales["Odometer (KM)"].hist()

In [ ]:
car_sales = pd.read_csv("car-sales.csv")

In [ ]:
car_sales

In [ ]:
car_sales

In [ ]:
car_sales["Make"].str.lower()

In [ ]:
car_sales

In [ ]:
car_sales["Make"] = car_sales["Make"].str.lower()

In [ ]:
car_sales

In [ ]:
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")
car_sales_missing

In [ ]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean())

In [ ]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(),
                                    inplace=True)

In [ ]:
car_sales_missing

In [ ]:
car_sales_missing.dropna(inplace=True)

In [ ]:
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")

In [ ]:
car_sales_missing_dropped = car_sales_missing.dropna()
car_sales_missing_dropped

In [ ]:
# Column from series
seats_column = pd.Series([5, 5, 5, 5, 5])

# New column called seats
car_sales["Seats"] = seats_column
car_sales

In [ ]:
car_sales["Seats"].fillna(5, inplace=True)

In [ ]:
car_sales

In [ ]:
# Column from Python list
fuel_economy = [7.5, 9.2, 5.0, 9.6, 8.7, 4.7, 7.6, 8.7, 3.0, 4.5]
car_sales["Fuel per 100KM"] = fuel_economy
car_sales

In [ ]:
car_sales["Total fuel used(L)"] = car_sales["Odometer (KM)"]/100 * car_sales["Fuel per 100KM"]

In [ ]:
car_sales

In [ ]:
# Create a column from a single value
car_sales["Number of wheels"] = 4
car_sales

In [ ]:
car_sales["Passsed road safety"] = True
car_sales

In [ ]:
car_sales = car_sales.drop("Toatal fuel used(L)", axis = 1)

In [ ]:
car_sales

In [ ]:
car_sales["Engine Warranty"] = car_sales["Odometer (KM)"].apply(lambda x: "False" if x > 100000 else "True")

car_sales

In [ ]:
car_sales_shuffled = car_sales.sample(frac=1)

In [ ]:
car_sales_shuffled

In [ ]:
# only select 20% of data
car_sales_shuffled.sample(frac=0.2)

In [ ]:
car_sales_shuffled

In [ ]:
car_sales_shuffled.reset_index(drop=True, inplace=True)

In [ ]:
car_sales_shuffled

In [ ]:
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x: x / 1.6)
car_sales